Revit 2027 API
Alignment.GetClosestPoint Method
 Calculates the point on the alignment's geometry which is closest to the given model point.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetClosestPoint(
	XYZ point
)
Public Function GetClosestPoint (
	point As XYZ
) As XYZ
public:
XYZ^ GetClosestPoint(
	XYZ^ point
)
member GetClosestPoint :
        point : XYZ -> XYZ
Parameters
point XYZ
The model point for which to calculate the closest point.
Return Value
XYZ
The alignment point closest to the given model point.
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace